ARTICLES = [
    {'Key': 'Предобработка данных',
     'Text': "Предварительная обработка и очистка данных — это важные этапы, "
             "обеспечивающие эффективное использование набора данных для машинного обучения. "
             "Необработанные данные зачастую искажены и ненадежны, и в них могут быть пропущены значения. "
             "Использование таких данных при моделировании может приводить к неверным результатам. "
             "Эти задачи являются частью процесса обработки и анализа данных группы и обычно "
             "подразумевают первоначальное изучение набора данных, используемого для определения и "
             "планирования необходимой предварительной обработки."},
    {'Key': 'Обучение с учителем',
    'Text': "Обучение с учителем (Supervised learning) — один из разделов машинного обучения, "
            "посвященный решению следующей задачи. Имеется множество объектов (ситуаций) и множество "
            "возможных ответов (откликов, реакций). Существует некоторая зависимость между ответами и "
            "объектами, но она неизвестна. Известна только конечная совокупность прецедентов — пар "
            "«объект, ответ», называемая обучающей выборкой. На основе этих данных требуется "
            "восстановить зависимость, то есть построить алгоритм, способный для любого объекта выдать "
            "достаточно точный ответ. Для измерения точности ответов определённым образом вводится "
            "функционал качества."},
    {'Key': 'Обучение без учителя',
    'Text': "Обучение без учителя (Unsupervised learning) — один из разделов машинного обучения. "
             "Изучает широкий класс задач обработки данных, в которых известны только описания множества"
             " объектов (обучающей выборки), и требуется обнаружить внутренние взаимосвязи, зависимости,"
             " закономерности, существующие между объектами. Обучение без учителя часто "
             "противопоставляется обучению с учителем, когда для каждого обучающего объекта задаётся "
             "«правильный ответ», и требуется найти зависимость между объектами и ответами."}
]
